{
  "chunks": {
    "count": 5,
    "distances": [
      0.55984545,
      0.55914265,
      0.55481553,
      0.55358297,
      0.5530821
    ],
    "documents": [
      "Course Title: Strategic Snail Racing Techniques. Course Type: Outdoor Skills. Instructor: Professor Slothington Snailhardt. Location: Inverness. Skills: Patience Observation Strategy Animal care Creativity. Learning Objectives: Understand the history and cultural significance of snail racing, Learn how to identify and train a champion snail, Master the art of snail racecourse design, Develop strategies for snail motivation and speed enhancement, Cultivate patience and observational skills. Provided Materials: Snail racing kit (track, flags, miniature trophy), Snail care booklet, Professional snail trainer's whistle, Magnifying glass, Notebook for observations. Description: Welcome to 'Strategic Snail Racing Techniques,' where you'll embark on a whimsical journey into the world of snail racing right in the heart of Inverness. Led by the esteemed Professor Slothington Snailhardt, this class will teach you everything you need to become a proficient snail racer and trainer. You'll begin by diving into the fascinating history of snail racing, uncovering its cultural roots and significance. Then, prepare to meet your new champions as you learn how to identify and select the finest racing snails. Discover the secrets of snail motivation as you master techniques that enhance their natural speed. Creativity takes center stage as you design your own racecourse, ensuring it meets the exacting standards of snail racing excellence. With the professional snail trainer's whistle in hand, you'll develop strategies to coax your molluscan athletes to victory. Beyond the races, cultivate your patience and observational prowess, skills that translate into all areas of life. Whether you're new to snail racing or a seasoned enthusiast, this playful yet practical class promises to nourish your soul and bring a smile to your face. Join us in this whimsical endeavor and leave with newfound skills, a snail racing kit, and perhaps even a miniature trophy to commemorate your achievements.",
      "Course Title: Advanced Hedgehog Husbandry. Course Type: Traditional Skills. Instructor: Mr. Pricklesworth. Location: Norfolk. Skills: Animal Care Wildlife Conservation Mindfulness Crafting, British Folklore. Learning Objectives: Learn the basics of hedgehog care and feeding, Understand the art of hedgehog habitats and environments, Master the gentle handling and health checks of hedgehogs, Cultivate patience and mindfulness through hedgehog observation, Explore the folklore and history of hedgehogs in Britain. Provided Materials: Hedgehog-friendly gloves, Illustrated hedgehog care guide, Notebook and pen for logging observations, Sample hedgehog treats, Miniature hedgehog habitat kit. Description: Welcome to \"Advanced Hedgehog Husbandry,\" a charming and slightly eccentric course designed for adults with an affection for these delightful creatures. Nestled in the picturesque countryside of Norfolk, join renowned hedgehog whisperer Mr. Pricklesworth as he imparts his decades of experience in the fine art of caring for these spiky wonders. Throughout this immersive day-long class, participants will learn essential skills, starting with the basics of hedgehog nutrition and how to prepare a balanced diet of worms and berries. You'll be introduced to the enchanting world of hedgehog habitats, where you'll craft the perfect cozy environment to encourage their natural behaviors. Handling hedgehogs is an art, and Mr. Pricklesworth will guide you through the gentle techniques needed for health checks and fostering trust with these timid creatures. As you settle into the rhythm of hedgehog care, you'll find opportunities to practice mindfulness, observing their quirky antics as a meditative practice. Finally, delve into the rich folklore surrounding hedgehogs in Britain, learning tales that have been passed down through generations. By the end of the class, you'll leave with a newfound respect and affection for these nocturnal companions, along with practical skills to care fo…",
      "Course Title: Whisker Symphony: The Art of Cat Choir Conducting. Course Type: Creative Arts. Instructor: Maestro Felix Furthoven. Location: Peak District. Skills: Conducting Animal Communication Creative Expression, Performance Arts Team Building. Learning Objectives: Learn the basics of conducting using a unique ensemble of feline vocals, Explore techniques for interpreting and synchronizing cat meows into harmonic, arrangements, Understand the importance of body language and expressive gestures in animal, communication, Develop skills in rhythm and tempo management with unconventional 'instruments', Gain experience in crafting a creative performance with non-traditional choir members. Provided Materials: Conductor's baton (cat-safe), Sheet music of classic meow symphonies, Training treats for feline participants, Portable scratching post metronome, Silken cat-themed conductor's cape. Description: Step into the enchanting world of feline harmonics with our \"Whisker Symphony: The Art of Cat Choir Conducting\" class! Led by the illustrious Maestro Felix Furthoven, whose expertise in both feline behavior and musical conducting is unmatched, this class invites adults to discover the unique joy of orchestrating a choir of cats. Located in the serene and inspiring Peak District, participants will learn how to conduct a symphony using the natural vocal abilities of our feline friends. The course begins with an introduction to basic conducting techniques — while normal conductors might lead violas or sopranos, you'll learn to lead meows, purrs, and chirps. Maestro Furthoven will guide you through crafting a harmonious arrangement using rhythm and tempo, all while keeping your furry performers engaged and content. With a silken cat-themed conductor's cape draped around your shoulders, you'll master the art of using your body language to express musical nuances, communicating in a way that resonates with your feline counterparts. Practical sessions with our trained cat choir…",
      "Course Title: Woodland Creature Construction & Conversing. Course Type: Nature Crafts. Instructor: Professor Twiggy Whittle. Location: Scottish Highlands. Skills: Craftsmanship Storytelling Ecological Awareness, Public Speaking Sustainability. Learning Objectives: Crafting whimsical woodland creatures using natural materials, Mastering the art of creative storytelling through crafted characters, Understanding the ecological benefits of using sustainable resources, Enhancing manual dexterity through fine crafting techniques, Developing public speaking skills through playful creature presentations. Provided Materials: Assorted twigs and branches, Pine cones, Natural dyes and paints, Eco-friendly glue, Wool and twine. Description: Welcome to an enchanting adventure where creativity meets the whimsical world of woodland creatures! In 'Woodland Creature Construction & Conversing,' participants will dive into the heart of the Scottish Highlands, using the bounty of nature to craft delightful creatures straight out of a fairy tale. Under the expert guidance of the ever- elusive Professor Twiggy Whittle, you'll collect twigs, pine cones, and other natural materials to assemble imaginative woodland critters. This playful class not only encourages creative craftsmanship but also enriches storytelling skills as each participant brings their creature to life with unique backstories. Learn the art of natural dyes and paints to give your creatures character and flair, while simultaneously understanding sustainable crafting practices that benefit our beloved ecosystems. As the creatures come to life, students will engage in a joyful creature showcase, honing public speaking skills in a supportive environment. Share tales and adventures of your whimsical companions with fellow classmates, fostering a community of camaraderie and laughter. By the end of this enchanting day, students will leave with not only their hand-crafted creations but also enhanced manual dexterity, ecological…",
      "Course Title: Feathered Friendship Flight School. Course Type: Outdoor Skills. Instructor: Professor Aviary Skylark. Location: Oxford. Skills: Birdwatching Nature Appreciation Conservation Mindfulness, Ecology. Learning Objectives: Understand basic bird anatomy and flight mechanics, Learn to identify common British birds by sight and sound, Master basic bird calling techniques, Create a safe and inviting garden habitat for birds, Practice mindful observation and appreciation of nature. Provided Materials: Binoculars, Bird identification guide, Bird call whistle, Bird-friendly seed mix, Miniature notebook for observations. Description: Join us at the enchanting Feathered Friendship Flight School, where Professor Aviary Skylark will guide you through the delightful world of avian allies. Nestled in the tranquil gardens of Oxford, this whimsical yet educational class invites adults to connect with nature and rediscover the joy found in the flutter of wings. During this three-hour session, students will embark on an avian adventure, starting with an engaging lecture on bird anatomy and the mechanics of flight. Armed with knowledge, binoculars, and a bird identification guide, participants will venture into the lush surroundings, learning to spot and identify common British birds by sight and sound. Professor Skylark, with her captivating expertise in bird-language, will teach students the art of bird calling, using specialized whistles to communicate with feathered friends. Participants will also learn how to create a bird-friendly garden, attracting a variety of species with expert tips and bird-friendly seed mixes. In the spirit of mindful observation, students will practice sitting quietly, honing their patience and deepening their appreciation for the natural world. They will record their discoveries in a charming miniature notebook, fostering a lifelong connection to the beauty and harmony of avian life. Leave the course with a heart full of joy, a mind brimming wi…"
    ],
    "ids": [
      "d33bf4ea-d3a2-54cf-95e1-c5e97b0e98a0",
      "6d0011f4-37c4-5be7-90bf-9ba3e54f09cd",
      "6a33e91d-c9e2-5453-90d3-8893ef6151fc",
      "47b70075-bda1-51a7-86e8-3a0eaee0fcec",
      "188248d4-6152-5af4-bda0-b609616e2a4a"
    ],
    "metadatas": [
      {
        "chunk_id": "chunk::104",
        "class_id": "CLASS_104",
        "cost": "£65.00",
        "course_id": 104,
        "course_type": "Outdoor Skills",
        "instructor": "Professor Slothington Snailhardt",
        "location": "Inverness",
        "title": "Strategic Snail Racing Techniques"
      },
      {
        "chunk_id": "chunk::4",
        "class_id": "CLASS_004",
        "cost": "£95.00",
        "course_id": 4,
        "course_type": "Traditional Skills",
        "instructor": "Mr. Pricklesworth",
        "location": "Norfolk",
        "title": "Advanced Hedgehog Husbandry"
      },
      {
        "chunk_id": "chunk::179",
        "class_id": "CLASS_179",
        "cost": "£85.00",
        "course_id": 179,
        "course_type": "Creative Arts",
        "instructor": "Maestro Felix Furthoven",
        "location": "Peak District",
        "title": "Whisker Symphony: The Art of Cat Choir Conducting"
      },
      {
        "chunk_id": "chunk::106",
        "class_id": "CLASS_106",
        "cost": "£75.00",
        "course_id": 106,
        "course_type": "Nature Crafts",
        "instructor": "Professor Twiggy Whittle",
        "location": "Scottish Highlands",
        "title": "Woodland Creature Construction & Conversing"
      },
      {
        "chunk_id": "chunk::21",
        "class_id": "CLASS_021",
        "cost": "£75.00",
        "course_id": 21,
        "course_type": "Outdoor Skills",
        "instructor": "Professor Aviary Skylark",
        "location": "Oxford",
        "title": "Feathered Friendship Flight School"
      }
    ]
  },
  "kg": {
    "count": 5,
    "distances": [
      0.6760072,
      0.67556655,
      0.67109585,
      0.6679795,
      0.6618508
    ],
    "documents": [
      "Dance belongs to theme Nature and Wildlife Cluster",
      "Expression belongs to theme Nature and Wildlife Cluster",
      "Design belongs to theme Nature and Wildlife Cluster",
      "Delve belongs to theme Nature and Wildlife Cluster",
      "Develop belongs to theme Nature and Wildlife Cluster"
    ],
    "ids": [
      "81fca491-faaa-5554-ba15-e9a9946c4934",
      "7137d5f8-27fe-59ad-8248-1e955589bf3d",
      "1c3e047a-37b6-5dcc-a5c9-c793196db53e",
      "75e0b765-7f0b-5960-877b-b1ac3bbb5ddd",
      "2cc71628-366b-5824-b5cc-e7f7cf4d4c52"
    ],
    "metadatas": [
      {
        "chunk_id": "kg::dance::belongs_to_theme::nature_and_wildlife_cluster",
        "object": "Nature and Wildlife Cluster",
        "predicate": "belongs_to_theme",
        "subject": "Dance",
        "term": "dance"
      },
      {
        "chunk_id": "kg::expression::belongs_to_theme::nature_and_wildlife_cluster",
        "object": "Nature and Wildlife Cluster",
        "predicate": "belongs_to_theme",
        "subject": "Expression",
        "term": "expression"
      },
      {
        "chunk_id": "kg::design::belongs_to_theme::nature_and_wildlife_cluster",
        "object": "Nature and Wildlife Cluster",
        "predicate": "belongs_to_theme",
        "subject": "Design",
        "term": "design"
      },
      {
        "chunk_id": "kg::delve::belongs_to_theme::nature_and_wildlife_cluster",
        "object": "Nature and Wildlife Cluster",
        "predicate": "belongs_to_theme",
        "subject": "Delve",
        "term": "delve"
      },
      {
        "chunk_id": "kg::develop::belongs_to_theme::nature_and_wildlife_cluster",
        "object": "Nature and Wildlife Cluster",
        "predicate": "belongs_to_theme",
        "subject": "Develop",
        "term": "develop"
      }
    ]
  },
  "query": "wildlife tracking"
}
